Обработки/Reports/_ОтчетОДоходностиПоАктивам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОДоходностиПоАктивам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючТекущегоВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОДоходностиПоАктивам/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	ЭтаФорма.Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"); 
		
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()   
	
	РеквизитФормыВЗначение("Отчет").Сформировать(Результат, Расшифровка, СписокСчетовДУ);  
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуПервогоВводаПоСчетуДУ(Организация, СчетДоверительногоУправления,ПериодОтчета)
	
	Возврат РеквизитФормыВЗначение("Отчет").ПолучитьДатуПервогоВводаПоСчетуДУ(Организация, СчетДоверительногоУправления, ПериодОтчета);

КонецФункции

&НаКлиенте
Процедура КомандаСформировать(Команда)
	
	
	Если Отчет.КлючТекущегоВарианта <>  "ДляУправляющих2" Тогда  
		ДатаПервогоВвода = ПолучитьДатуПервогоВводаПоСчетуДУ(Отчет.Организация, Отчет.СчетДоверительногоУправления,Отчет.Период);
		Если ДатаПервогоВвода = Неопределено Тогда
			ПоказатьПредупреждение(, "По счету доверительного управления не зарегистрировано ни одного ввода.");
			Возврат;	
		КонецЕсли;
		
		Если ДатаПервогоВвода > Отчет.Период.ДатаНачала Тогда
			РезультатВопроса = Вопрос("Дата начала периода расчета выбрана ранее, чем дата первого ввода." + Символы.ПС + "Для формирования отчета период расчета будет изменен. Продолжить?", РежимДиалогаВопрос.ОКОтмена);
			Если РезультатВопроса <> КодВозвратаДиалога.ОК Тогда
				Возврат;
			КонецЕсли;
			
			Отчет.Период.ДатаНачала = ДатаПервогоВвода;
			
			Если Отчет.Период.ДатаНачала > Отчет.Период.ДатаОкончания Тогда
				Отчет.Период.ДатаОкончания = Мин(КонецМесяца(Отчет.Период.ДатаНачала), ТекущаяДата());	
			КонецЕсли;
			
		КонецЕсли;
		
		
		Если НЕ ЭтаФорма.ПроверитьЗаполнение() Тогда 
			Возврат;
		КонецЕсли;	 
	КонецЕсли;
	
	СформироватьНаСервере();          
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат); 
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Расшифровка);

	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");  
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Расшифровка, "НеАктуальность");  
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокВариантов()
	СписокВариантов = Новый СписокЗначений;
	
	СписокВариантов.Добавить("Основной",		"Клиентский отдел");
	СписокВариантов.Добавить("ДляУправляющих",	"Для управляющих");
	СписокВариантов.Добавить("ДляУправляющих2",	"Для управляющих по группе счетов ДУ");
	
	Возврат СписокВариантов; 
КонецФункции

&НаКлиенте

&НаКлиенте
Процедура КомандаВыбратьВариант(Команда) 
	
	СписокВыбора = ПолучитьСписокВариантов();
	
	ВыбранноеЗначение = СписокВыбора.ВыбратьЭлемент("Выбор варианта отчета", СписокВыбора.НайтиПоЗначению(Отчет.КлючТекущегоВарианта));
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		Отчет.КлючТекущегоВарианта = ВыбранноеЗначение.Значение;
		ЭтаФорма.Заголовок = "Отчет о доходности по активам:" + " (" + ВыбранноеЗначение.Представление + ")";
		
	КонецЕсли; 
	
	ПроставитьВидимостьДоступностьРеквизитов();   
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность"); 
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Расшифровка, "НеАктуальность"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СписокВыбора = ПолучитьСписокВариантов();
	
	Если НЕ ЗначениеЗаполнено(Отчет.КлючТекущегоВарианта) Тогда 
		Вариант = СписокВыбора.НайтиПоЗначению("Основной");    
		Отчет.КлючТекущегоВарианта = Вариант;
	Иначе 
		Вариант = СписокВыбора.НайтиПоЗначению(Отчет.КлючТекущегоВарианта);
	КонецЕсли; 
	ЭтаФорма.Заголовок = "Отчет о доходности по активам:" + " (" + Вариант.Представление + ")";  
	
	ПроставитьВидимостьДоступностьРеквизитов();
	
КонецПроцедуры

&НаКлиенте 
Процедура ПроставитьВидимостьДоступностьРеквизитов()
	
	РежимВидимости = ?(Отчет.КлючТекущегоВарианта = "ДляУправляющих2", Истина, Ложь);
	
	ЭтаФорма.Элементы.СписокСчетовДУ.Видимость = РежимВидимости;
	ЭтаФорма.Элементы.ФормаКомандаСохранитьПараметры.Видимость = РежимВидимости;
	ЭтаФорма.Элементы.ФормаКомандаВосстановитьПараметры.Видимость = РежимВидимости;
	
КонецПроцедуры 

&НаКлиенте
Процедура КомандаСохранитьПараметры(Команда)

	Настройки = Новый Структура("СписокСчетовДУ", ЭтаФорма.СписокСчетовДУ);
	
	
	РаботаСФормамиКлиент.СохранитьНастройкиВХранилищеВариантовИНастроекОтчетов(ЭтаФорма.ИмяФормы, ЭтаФорма.КлючТекущегоСпискаСчетовДУ, Настройки, Отчет.Организация);
		
КонецПроцедуры


&НаКлиенте
Процедура КомандаВосстановитьПараметры(Команда)
	
	ОписаниеНастроек = РаботаСФормамиКлиент.ПолучитьНастройкиИзХранилищаВариантовИНастроекОтчетов(ЭтаФорма.ИмяФормы, ЭтаФорма.КлючТекущегоСпискаСчетовДУ, Отчет.Организация);
	
	Если ОписаниеНастроек <> Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ОписаниеНастроек.Настройки);
	
	КонецЕсли;
	
КонецПроцедуры
